In [1]:
import pandas as pd

In [3]:
pd.read_csv('data/data.csv')

    Name  Age
0  Alice   25
1    Bob   30

In [4]:
pd.read_json('data/data.json')

    name  age
0  Alice   25

In [5]:
pd.read_csv('data/example.txt')

                Hello world!
0  This is an appended line.

In [7]:
file_path='https://raw.githubusercontent.com/laxmimerit/All-CSV-ML-Data-Files-Download/master/titanic.csv'
df=pd.read_csv(file_path)

In [8]:
df.to_csv('data/df_titanic.csv',index=None)

In [9]:
df.to_csv('data/df_titanic_custom_sep.tsv',index=None,sep='\t')

In [10]:
df.to_csv('data/df-titanic_custom_sep.txt',index=None,sep='|')

In [13]:
df.columns,len(df.columns)

(Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
        'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
       dtype='object'),
 12)

In [16]:
df.columns=[x.lower() for x in df.columns]
print(df.columns)

Index(['passengerid', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

In [17]:
type(df['age'])

pandas.core.series.Series

In [19]:
df['family_size']=df['sibsp']+df['parch']
print(df.columns)

Index(['passengerid', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked', 'family_size'],
      dtype='object')

In [25]:
df['fare_per_person']=df['fare']/(df['family_size']+1)
print(df.columns)
print(df['fare'],df['family_size'],df['fare_per_person'])

Index(['passengerid', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked', 'family_size',
       'fare_per_person'],
      dtype='object')
0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64 0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Name: family_size, Length: 891, dtype: int64 0       3.62500
1      35.64165
2       7.92500
3      26.55000
4       8.05000
         ...
886    13.00000
887    30.00000
888     5.86250
889    30.00000
890     7.75000
Name: fare_per_person, Length: 891, dtype: float64

In [29]:
df['is_alone']=df['family_size'].apply(lambda x:1 if x==0 else 0)
print(df['is_alone'])

0      0
1      0
2      1
3      0
4      1
      ..
886    1
887    1
888    0
889    1
890    1
Name: is_alone, Length: 891, dtype: int64

In [33]:
df['is_alone_bool']=(df['family_size'].astype('bool')).astype('int')
print(df['is_alone_bool'])

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    1
889    0
890    0
Name: is_alone_bool, Length: 891, dtype: int64

In [38]:
df['is_alone_condition']=(df['family_size']==0).astype('int')
print(df[['family_size','is_alone_condition']])

     family_size  is_alone_condition
0              1                   0
1              1                   0
2              0                   1
3              1                   0
4              0                   1
..           ...                 ...
886            0                   1
887            0                   1
888            3                   0
889            0                   1
890            0                   1

[891 rows x 2 columns]

In [40]:
df=df.rename(columns={'sibsp':'sibling/spouse abroad'})
print(df.columns)

Index(['passengerid', 'survived', 'pclass', 'name', 'sex', 'age',
       'sibling/spouse abroad', 'parch', 'ticket', 'fare', 'cabin', 'embarked',
       'family_size', 'fare_per_person', 'is_alone', 'is_alone_bool',
       'is_alone_condition'],
      dtype='object')

In [42]:
df=df.rename(columns={'pclass':'passenger_class','sex':'gender'})
print(df.columns)

Index(['passengerid', 'survived', 'passenger_class', 'name', 'gender', 'age',
       'sibling/spouse abroad', 'parch', 'ticket', 'fare', 'cabin', 'embarked',
       'family_size', 'fare_per_person', 'is_alone', 'is_alone_bool',
       'is_alone_condition'],
      dtype='object')

In [46]:
df['is_adult']=(df['age']>=18).astype('int')
print(df[['age','is_adult']])

      age  is_adult
0    22.0         1
1    38.0         1
2    26.0         1
3    35.0         1
4    35.0         1
..    ...       ...
886  27.0         1
887  19.0         1
888   NaN         0
889  26.0         1
890  32.0         1

[891 rows x 2 columns]

In [50]:
# df[['age','is_adult','sibling/spouse abroad','fare']]
# numerical_cols=df.select_dtypes(include='number')
# print(numerical_cols)

object_cols=df.select_dtypes(exclude='number')
print(object_cols)

                                                  name  gender  \
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

               ticket cabin embarked
0           A/5 21171   NaN        S
1            PC 17599   C85        C
2    STON/O2. 3101282   NaN        S
3              113803  C123        S
4              373450   NaN        S
..                ...   ...      ...
886            211536   NaN        S
887            112053   B42        S
888        W./C. 6607   NaN        S
889            111369  C148        C
890            370376   NaN        Q

[891 rows x 5 columns]

In [51]:
df.head(1)

,passengerid,survived,passenger_class,name,gender,age,sibling/spouse abroad,parch,ticket,fare,cabin,embarked,family_size,fare_per_person,is_alone,is_alone_bool,is_alone_condition,is_adult
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,1,3.625,0,1,0,1

In [52]:
df.tail(1)

,passengerid,survived,passenger_class,name,gender,age,sibling/spouse abroad,parch,ticket,fare,cabin,embarked,family_size,fare_per_person,is_alone,is_alone_bool,is_alone_condition,is_adult
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,0,7.75,1,0,1,1

In [53]:
df.sample(5)
df.sample(frac=0.01)
df.sample(frac=0.01,random_state=1)

,passengerid,survived,passenger_class,name,gender,age,sibling/spouse abroad,parch,ticket,fare,cabin,embarked,family_size,fare_per_person,is_alone,is_alone_bool,is_alone_condition,is_adult
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S,0,25.929200,1,0,1,1
223,224,0,3,"Nenkoff, Mr. Christo",male,NaN,0,0,349234,7.8958,NaN,S,0,7.895800,1,0,1,0
84,85,1,2,"Ilett, Miss. Bertha",female,17.0,0,0,SO/C 14885,10.5000,NaN,S,0,10.500000,1,0,1,0
680,681,0,3,"Peters, Miss. Katie",female,NaN,0,0,330935,8.1375,NaN,Q,0,8.137500,1,0,1,0
535,536,1,2,"Hart, Miss. Eva Miriam",female,7.0,0,2,F.C.C. 13529,26.2500,NaN,S,2,8.750000,0,1,0,0
623,624,0,3,"Hansen, Mr. Henry Damsgaard",male,21.0,0,0,350029,7.8542,NaN,S,0,7.854200,1,0,1,1
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S,2,8.666667,0,1,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,26.550000,0,1,0,1
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C,1,41.085400,0,1,0,1